<a href="https://colab.research.google.com/github/shakthi-stack/DataScience15cse431/blob/master/pandas_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Basic commands in pandas package

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

##read_csv

In [ ]:
import pandas as pd
df=pd.read_csv("/content/drive/My Drive/Colab Notebooks/weather_data.csv")
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

##pd.DataFrame

In [ ]:
import pandas as pd
weather_data_1={"day" :["mon","tue"],
               "date" :["1,3,20","2,3,20"],
               "temp" :[23.5,32.4]}
df = pd.DataFrame(weather_data_1)
df

   day    date  temp
0  mon  1,3,20  23.5
1  tue  2,3,20  32.4

##pd.head() & pd.tail() & pd.sample()

In [ ]:
import pandas as pd
df=pd.read_csv("/content/drive/My Drive/Colab Notebooks/weather_data.csv")#used to read csv file
df.head() #displays the first 5 rows

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [ ]:
import pandas as pd
df=pd.read_csv("/content/drive/My Drive/Colab Notebooks/weather_data.csv")#used to read csv file
df.head(2)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [ ]:
import pandas as pd
df=pd.read_csv("/content/drive/My Drive/Colab Notebooks/weather_data.csv")#used to read csv file
df.tail()#diasplays last 5 rows

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.tail(2)#diasplays last 2 rows

        day  temperature  windspeed  event
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.sample(2)#random display

        day  temperature  windspeed event
3  1/4/2017           24          7  Snow
0  1/1/2017           32          6  Rain

##df.shape

In [ ]:
rows,columns=df.shape#gives the number of rows and columns
print(rows,columns)

6 4

##df.dtypes

In [ ]:
df.dtypes#gives datatypes of elements of df

day            object
temperature     int64
windspeed       int64
event          object
dtype: object

df.set_index()

In [ ]:
df.set_index("day")#sets the parameter gives as the index column
#Temperory change

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df#no change in actual data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df=df.set_index("day")#sets day as permanent index
#we can also use df.set_index("day",inplace=True)
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df.reset_index(inplace=True)#resets the index  
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

##row and column access

In [ ]:
df["temperature"]#gives the temperature coulumn alone

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [ ]:
#or we can use
df.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [ ]:
df[["temperature","event"]]#access multiple columns

   temperature  event
0           32   Rain
1           35  Sunny
2           28   Snow
3           24   Snow
4           32   Rain
5           31  Sunny

##df.info()

In [ ]:
df.info()#Gives all the info about the created dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

##df.rename()

In [ ]:
#changing column name (temporary)
df.rename(columns={
    "event":"Event",
    "temperature":"Temperature"
})

        day  Temperature  windspeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

##df.describe()

In [ ]:
df.describe()#gives all the statistical info all numerical columns

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [ ]:
#force describe() to include non numerical columns
df.describe(include="all")

             day  temperature  windspeed  event
count          6     6.000000   6.000000      6
unique         6          NaN        NaN      3
top     1/3/2017          NaN        NaN  Sunny
freq           1          NaN        NaN      2
mean         NaN    30.333333   4.666667    NaN
std          NaN     3.829708   2.338090    NaN
min          NaN    24.000000   2.000000    NaN
25%          NaN    28.750000   2.500000    NaN
50%          NaN    31.500000   5.000000    NaN
75%          NaN    32.000000   6.750000    NaN
max          NaN    35.000000   7.000000    NaN

##df.drop()

In [ ]:
df.drop(['event'],axis=1)#removes a column temporarily

        day  temperature  windspeed
0  1/1/2017           32          6
1  1/2/2017           35          7
2  1/3/2017           28          2
3  1/4/2017           24          7
4  1/5/2017           32          4
5  1/6/2017           31          2

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.drop(['event'],axis=1,inplace=True)
#permanent deletion of column

In [ ]:
df

        day  temperature  windspeed
0  1/1/2017           32          6
1  1/2/2017           35          7
2  1/3/2017           28          2
3  1/4/2017           24          7
4  1/5/2017           32          4
5  1/6/2017           31          2

In [ ]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/pplonski/datasets-for-start/master/credit/data.csv")
df.dtypes

Id                                        int64
SeriousDlqin2yrs                          int64
RevolvingUtilizationOfUnsecuredLines    float64
age                                       int64
NumberOfTime30-59DaysPastDueNotWorse      int64
DebtRatio                               float64
MonthlyIncome                           float64
NumberOfOpenCreditLinesAndLoans           int64
NumberOfTimes90DaysLate                   int64
NumberRealEstateLoansOrLines              int64
NumberOfTime60-89DaysPastDueNotWorse      int64
NumberOfDependents                      float64
dtype: object

In [ ]:
rows,columns=df.shape#gives the number of rows and columns
print(rows,columns)

150000 12

In [ ]:
df.describe()

                  Id  ...  NumberOfDependents
count  150000.000000  ...       146076.000000
mean    75000.500000  ...            0.757222
std     43301.414527  ...            1.115086
min         1.000000  ...            0.000000
25%     37500.750000  ...            0.000000
50%     75000.500000  ...            0.000000
75%    112500.250000  ...            1.000000
max    150000.000000  ...           20.000000

[8 rows x 12 columns]

In [ ]:
df.set_index("Id")

        SeriousDlqin2yrs  ...  NumberOfDependents
Id                        ...
1                      1  ...                 2.0
2                      0  ...                 1.0
3                      0  ...                 0.0
4                      0  ...                 0.0
5                      0  ...                 0.0
...                  ...  ...                 ...
149996                 0  ...                 0.0
149997                 0  ...                 2.0
149998                 0  ...                 0.0
149999                 0  ...                 0.0
150000                 0  ...                 0.0

[150000 rows x 11 columns]

In [ ]:
df.rename(columns={
    "NumberOfTime30-59DaysPastDueNotWorse":"Num30-59DaysPastDue",
    "RevolvingUtilizationOfUnsecuredLines":"RevolvingUtilOfUnsecLines"
    
})

            Id  ...  NumberOfDependents
0            1  ...                 2.0
1            2  ...                 1.0
2            3  ...                 0.0
3            4  ...                 0.0
4            5  ...                 0.0
...        ...  ...                 ...
149995  149996  ...                 0.0
149996  149997  ...                 2.0
149997  149998  ...                 0.0
149998  149999  ...                 0.0
149999  150000  ...                 0.0

[150000 rows x 12 columns]

#(25/07/2020)

#pd.read_csv()

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
import pandas as pd
df=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_2.csv")
df

   2   1500        Good   300000
0  3   1300        Fair   240000
1  3   1900   Very good   450000
2  3   1850         Bad   280000
3  2   1640        Good   310000

In [ ]:
df=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_2.csv",header=None)
df

   0     1           2       3
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

In [ ]:
df=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_2.csv",header=None,names=["Bedroom","Sq.ft","Locality","Price($)"])
df

   Bedroom  Sq.ft    Locality  Price($)
0        2   1500        Good    300000
1        3   1300        Fair    240000
2        3   1900   Very good    450000
3        3   1850         Bad    280000
4        2   1640        Good    310000

In [ ]:
df3=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_3.csv")
df3

  Bedroom; Sq. foot; Locality; Price ($)
0                  2; 1500; Good; 300000
1                  3; 1300; Fair; 240000
2             3; 1900; Very good; 450000
3                   3; 1850; Bad; 280000
4                  2; 1640; Good; 310000

In [ ]:
#Reading csv files which are not "," separared. Say ";"
df3=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_3.csv",sep=";")
df3
#we can a attribute sep=<"separation symbol">

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
#We can give additional header to a column using names attribute
df4=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_1.csv",names=["A","B","C","D"])
df4

         A          B           C           D
0  Bedroom   Sq. foot    Locality   Price ($)
1        2       1500        Good      300000
2        3       1300        Fair      240000
3        3       1900   Very good      450000
4        3       1850         Bad      280000
5        2       1640        Good      310000

In [ ]:
#We can give change the existing header of a column using names attribute plus header attribute = 0
df4=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_1.csv",header=0,names=["A","B","C","D"])
df4

   A     B           C       D
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

In [ ]:
df5=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_skiprows.csv")
df5

  Filetype: CSV              Unnamed: 1  Unnamed: 2  Unnamed: 3
0           NaN  Info about some houses         NaN         NaN
1       Bedroom                Sq. foot    Locality   Price ($)
2             2                    1500        Good      300000
3             3                    1300        Fair      240000
4             3                    1900   Very good      450000
5             3                    1850         Bad      280000
6             2                    1640        Good      310000

In [ ]:
#We can skip unwanted rows of a csv file using skiprows parameter
df5=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_skiprows.csv",skiprows=2)
df5

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df6=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_skipfooter.csv")
df6

  Filetype: CSV                Unnamed: 1  Unnamed: 2  Unnamed: 3
0           NaN    Info about some houses         NaN         NaN
1       Bedroom                  Sq. foot    Locality   Price ($)
2             2                      1500        Good      300000
3             3                      1300        Fair      240000
4             3                      1900   Very good      450000
5             3                      1850         Bad      280000
6             2                      1640        Good      310000
7           NaN   This is the end of file         NaN         NaN

In [ ]:
#we can skip the last few unwanted rows by using skipfooter attribute
df6=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_skipfooter.csv",skiprows=2,skipfooter=1,engine="python")
df6

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
#read only a particular nos of rows using nrows attribute
df7=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_1.csv",nrows=2)
df7

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000
1        3       1300      Fair      240000

In [ ]:
df9=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_blankline.csv")
df9

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
#If don't want the blank lines in the csv to be skipped, we can set skip_blank_lines attribute to False
df9=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_blankline.csv",skip_blank_lines=False)
df9

   Bedroom   Sq. foot    Locality   Price ($)
0      2.0     1500.0        Good    300000.0
1      3.0     1300.0        Fair    240000.0
2      NaN        NaN         NaN         NaN
3      3.0     1900.0   Very good    450000.0
4      3.0     1850.0         Bad    280000.0
5      NaN        NaN         NaN         NaN
6      2.0     1640.0        Good    310000.0

In [ ]:
#we can read zip files directly using read_csv()
df10=pd.read_csv("/content/drive/My Drive/Colab Notebooks/dataset/CSV_EX_1.zip")
df10

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
#we can read zip files directly using read_csv()
df10=pd.read_csv("/content/drive/My Drive/Colab Notebooks/winequality-red.csv",sep=";")
df10

      fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0               7.4             0.700         0.00  ...       0.56      9.4        5
1               7.8             0.880         0.00  ...       0.68      9.8        5
2               7.8             0.760         0.04  ...       0.65      9.8        5
3              11.2             0.280         0.56  ...       0.58      9.8        6
4               7.4             0.700         0.00  ...       0.56      9.4        5
...             ...               ...          ...  ...        ...      ...      ...
1594            6.2             0.600         0.08  ...       0.58     10.5        5
1595            5.9             0.550         0.10  ...       0.76     11.2        6
1596            6.3             0.510         0.13  ...       0.75     11.0        6
1597            5.9             0.645         0.12  ...       0.71     10.2        5
1598            6.0             0.310         0.47  ...       0.66     11.0        6

[1599 rows x 12 columns]

In [ ]:
df10.dtypes

fixed acidity           float64
volatile acidity        float64
citric acid             float64
residual sugar          float64
chlorides               float64
free sulfur dioxide     float64
total sulfur dioxide    float64
density                 float64
pH                      float64
sulphates               float64
alcohol                 float64
quality                   int64
dtype: object

In [ ]:
df10.describe

<bound method NDFrame.describe of       fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0               7.4             0.700         0.00  ...       0.56      9.4        5
1               7.8             0.880         0.00  ...       0.68      9.8        5
2               7.8             0.760         0.04  ...       0.65      9.8        5
3              11.2             0.280         0.56  ...       0.58      9.8        6
4               7.4             0.700         0.00  ...       0.56      9.4        5
...             ...               ...          ...  ...        ...      ...      ...
1594            6.2             0.600         0.08  ...       0.58     10.5        5
1595            5.9             0.550         0.10  ...       0.76     11.2        6
1596            6.3             0.510         0.13  ...       0.75     11.0        6
1597            5.9             0.645         0.12  ...       0.71     10.2        5
1598            6.0             0.310         0.47  ...       0.66     11.0        6

[1599 rows x 12 columns]>

In [ ]:
df10

##(30-07-2020)

In [ ]:
import pandas as pd
df11=pd.read_csv("https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv")

In [ ]:
df11.head()

                    company  rank  ...  employees  total_stockholder_equity
0                   Walmart     1  ...    2300000                     77798
1                State Grid     2  ...     926067                    209456
2             Sinopec Group     3  ...     713288                    106523
3  China National Petroleum     4  ...    1512048                    301893
4              Toyota Motor     5  ...     364445                    157210

[5 rows x 17 columns]

In [ ]:
#index_col
df12=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv',index_col=0)
df12.head()

                          rank  revenues  ...  employees  total_stockholder_equity
company                                   ...
Walmart                      1    485873  ...    2300000                     77798
State Grid                   2    315199  ...     926067                    209456
Sinopec Group                3    267518  ...     713288                    106523
China National Petroleum     4    262573  ...    1512048                    301893
Toyota Motor                 5    254694  ...     364445                    157210

[5 rows x 16 columns]

In [ ]:
df12=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv',index_col=[0,1])
df12.head()

                               revenues  ...  total_stockholder_equity
company                  rank            ...
Walmart                  1       485873  ...                     77798
State Grid               2       315199  ...                    209456
Sinopec Group            3       267518  ...                    106523
China National Petroleum 4       262573  ...                    301893
Toyota Motor             5       254694  ...                    157210

[5 rows x 15 columns]

In [ ]:
df13=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv',index_col=["company","rank"])
df13.head()

                               revenues  ...  total_stockholder_equity
company                  rank            ...
Walmart                  1       485873  ...                     77798
State Grid               2       315199  ...                    209456
Sinopec Group            3       267518  ...                    106523
China National Petroleum 4       262573  ...                    301893
Toyota Motor             5       254694  ...                    157210

[5 rows x 15 columns]

#pd.read() with usecols

In [ ]:
#usecols()
df13=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv',usecols=[0,1,2])
df13.head()

                    company  rank  revenues
0                   Walmart     1    485873
1                State Grid     2    315199
2             Sinopec Group     3    267518
3  China National Petroleum     4    262573
4              Toyota Motor     5    254694

In [ ]:
#usecols()
df14=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv',usecols= lambda column : column not in ["company","rank","revenues"])
df14.head()

   revenue_change  profits  ...  employees  total_stockholder_equity
0             0.8  13643.0  ...    2300000                     77798
1            -4.4   9571.3  ...     926067                    209456
2            -9.1   1257.9  ...     713288                    106523
3           -12.3   1867.5  ...    1512048                    301893
4             7.7  16899.3  ...     364445                    157210

[5 rows x 14 columns]

##(30/07/2020)

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

#pd.read_excel()

In [ ]:

df15=pd.read_excel("/content/drive/My Drive/Colab Notebooks/dataset/Housing_data.xlsx")
df15

      CRIM    ZN  INDUS  CHAS    NOX  ...  TAX  PTRATIO       B  LSTAT  PRICE
0  0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98   24.0
1  0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14   21.6
2  0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03   34.7
3  0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94   33.4
4  0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33   36.2
5  0.02985   0.0   2.18     0  0.458  ...  222     18.7  394.12   5.21   28.7
6  0.08829  12.5   7.87     0  0.524  ...  311     15.2  395.60  12.43   22.9
7  0.14455  12.5   7.87     0  0.524  ...  311     15.2  396.90  19.15   27.1
8  0.21124  12.5   7.87     0  0.524  ...  311     15.2  386.63  29.93   16.5

[9 rows x 14 columns]

In [ ]:
dict_df15=pd.read_excel("/content/drive/My Drive/Colab Notebooks/dataset/Housing_data.xlsx",sheet_name=None)
dict_df15.keys()

dict_keys(['Data_Tab_1', 'Data_Tab_2', 'Data_Tab_3'])

##pd.read_table() // for comma sep txt file

In [ ]:
df16=pd.read_table("/content/drive/My Drive/Colab Notebooks/dataset/Table_EX_1.txt",sep=",")
df16

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df17=pd.read_table("/content/drive/My Drive/Colab Notebooks/dataset/Table_tab_separated.txt")
df17

   Bedroom  Sq. foot   Locality  Price ($)
0        2      1500       Good     300000
1        3      1300       Fair     240000
2        3      1900  Very good     450000
3        3      1850        Bad     280000
4        2      1640       Good     310000

##pd.read_html()

In [ ]:
url="http://www.fdic.gov/bank/individual/failed/banklist.html"
list_of_df=pd.read_html(url)

In [ ]:
df17=list_of_df[0]
df17.head()

                          Bank Name  ...       Closing Date
0              The First State Bank  ...      April 3, 2020
1                Ericson State Bank  ...  February 14, 2020
2  City National Bank of New Jersey  ...   November 1, 2019
3                     Resolute Bank  ...   October 25, 2019
4             Louisa Community Bank  ...   October 25, 2019

[5 rows x 6 columns]

In [ ]:
url2="https://en.wikipedia.org/wiki/2016_Summer_Olympics_medal_table"
list_of_df=pd.read_html(url2)

In [ ]:
len(list_of_df)

7

In [ ]:
for t in list_of_df:
  print(t.shape)

(2, 1)
(87, 6)
(10, 9)
(1, 2)
(1, 2)
(4, 2)
(1, 2)

In [ ]:
df18=list_of_df[1]
df18.head()

  Rank                  NOC  Gold  Silver  Bronze  Total
0    1  United States (USA)    46      37      38    121
1    2  Great Britain (GBR)    27      23      17     67
2    3          China (CHN)    26      18      26     70
3    4         Russia (RUS)    19      17      20     56
4    5        Germany (GER)    17      10      15     42

In [ ]:
df19=list_of_df[2]
df19.head()

                                         Ruling date  ...                                         Unnamed: 8
0  List of official changes in medal standings (d...  ...  List of official changes in medal standings (d...
1                                     18 August 2016  ...                                                NaN
2                                     18 August 2016  ...                                                NaN
3  List of official changes in medal standings (a...  ...  List of official changes in medal standings (a...
4                                    8 December 2016  ...                                                NaN

[5 rows x 9 columns]

##pd.read_json()

In [ ]:
df20=pd.read_json("/content/drive/My Drive/Colab Notebooks/dataset/movies.json")

In [ ]:
df20.head()

                                  title  year cast genres
0            After Dark in Central Park  1900   []     []
1  Boarding School Girls' Pajama Parade  1900   []     []
2        Buffalo Bill's Wild West Parad  1900   []     []
3                                Caught  1900   []     []
4                  Clowns Spinning Hats  1900   []     []

##pd.read_dta()

In [ ]:
df21=pd.read_stata("/content/drive/My Drive/Colab Notebooks/dataset/rscfp2016.dta")

In [ ]:
df21.head()

   YY1  Y1          wgt  hhsex  ...  NINC2CAT  nwpctlecat  incpctlecat  nincpctlecat
0    1  11  6427.136676      2  ...         1           7            1             1
1    1  12  6428.350592      2  ...         1           7            1             1
2    1  13  6414.477294      2  ...         1           7            1             1
3    1  14  6428.487972      2  ...         1           7            1             1
4    1  15  6425.256822      2  ...         1           7            1             1

[5 rows x 348 columns]

#Read pdf using tabula-py // read_pdf()

In [ ]:
pip install tabula-py

Collecting tabula-py
  Downloading https://files.pythonhosted.org/packages/8d/ed/20655a47a603430272c995d908d0dd96f93c2aa8973c8a55a66c8f3b8dfe/tabula_py-2.1.1-py3-none-any.whl (10.4MB)
     |████████████████████████████████| 10.4MB 3.3MB/s
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from tabula-py) (1.18.5)
Requirement already satisfied: pandas>=0.25.3 in /usr/local/lib/python3.6/dist-packages (from tabula-py) (1.0.5)
Collecting distro
  Downloading https://files.pythonhosted.org/packages/25/b7/b3c4270a11414cb22c6352ebc7a83aaa3712043be29daa05018fd5a5c956/distro-1.5.0-py2.py3-none-any.whl
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.25.3->tabula-py) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.25.3->tabula-py) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas>=0.25.3->tabula-py) (1.15.0)
Installing collected packages: distro, tabula-py
Successfully installed distro-1.5.0 tabula-py-2.1.1

In [ ]:
from tabula import read_pdf
df21=read_pdf("/content/drive/My Drive/Colab Notebooks/dataset/Housing_data.pdf",pages=[1],pandas_options={"header":None})
df21[0]

         0     1     2  3      4      5     6       7  8    9
0  0.17004  12.5  7.87  0  0.524  6.004  85.9  6.5921  5  311
1  0.22489  12.5  7.87  0  0.524  6.377  94.3  6.3467  5  311
2  0.11747  12.5  7.87  0  0.524  6.009  82.9  6.2267  5  311
3  0.09378  12.5  7.87  0  0.524  5.889  39.0  5.4509  5  311

In [ ]:
from tabula import read_pdf
df22=read_pdf("/content/drive/My Drive/Colab Notebooks/dataset/Housing_data.pdf",pages=[2],pandas_options={"header":None})
df22[0]

      0       1      2     3
0  15.2  386.71  17.10  18.9
1  15.2  392.52  20.45  15.0
2  15.2  396.90  13.27  18.9
3  15.2  390.50  15.71  21.7

##Selecting panadas data (iloc)

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
import pandas as pd
df23=pd.read_csv("/content/drive/My Drive/Colab Notebooks/uk-500.csv")
df23.head()

  first_name  ...                                   web
0    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
1       Evan  ...     http://www.capgeminiamerica.co.uk
2     France  ...      http://www.elliottjohnwesq.co.uk
3    Ulysses  ...          http://www.mcmahanbenl.co.uk
4     Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 11 columns]

In [ ]:
#single selection
df23.iloc[0]#first line

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
Name: 0, dtype: object

In [ ]:
df23.tail()

    first_name  ...                                          web
495      Avery  ...    http://www.plazagourmetdelicatessen.co.uk
496       Reid  ...           http://www.fitzgeraldedwardj.co.uk
497  Charlette  ...             http://www.fureyassociates.co.uk
498  Celestina  ...       http://www.bfgfederalcreditunion.co.uk
499         Mi  ...  http://www.nelsonwrighthaworthgolfcrs.co.uk

[5 rows x 11 columns]

In [ ]:
df23.iloc[-1]#last row

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: 499, dtype: object

In [ ]:
#fetch column-wise 
df23.iloc[:,0]#first column

0        Aleshia
1           Evan
2         France
3        Ulysses
4         Tyisha
         ...
495        Avery
496         Reid
497    Charlette
498    Celestina
499           Mi
Name: first_name, Length: 500, dtype: object

In [ ]:
df23.iloc[:,-1]

0             http://www.alandrosenburgcpapc.co.uk
1                http://www.capgeminiamerica.co.uk
2                 http://www.elliottjohnwesq.co.uk
3                     http://www.mcmahanbenl.co.uk
4                   http://www.champagneroom.co.uk
                          ...
495      http://www.plazagourmetdelicatessen.co.uk
496             http://www.fitzgeraldedwardj.co.uk
497               http://www.fureyassociates.co.uk
498         http://www.bfgfederalcreditunion.co.uk
499    http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: web, Length: 500, dtype: object

In [ ]:
#multiple row and column selections using iloc
df23.iloc[0:5]#first five rows

  first_name  ...                                   web
0    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
1       Evan  ...     http://www.capgeminiamerica.co.uk
2     France  ...      http://www.elliottjohnwesq.co.uk
3    Ulysses  ...          http://www.mcmahanbenl.co.uk
4     Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 11 columns]

In [ ]:
df23.iloc[:,0:2]#first 2 columns

    first_name   last_name
0      Aleshia  Tomkiewicz
1         Evan   Zigomalas
2       France     Andrade
3      Ulysses   Mcwalters
4       Tyisha      Veness
..         ...         ...
495      Avery        Veit
496       Reid     Euresti
497  Charlette    Brenning
498  Celestina       Keeny
499         Mi      Richan

[500 rows x 2 columns]

In [ ]:
df23.iloc[[0,3,6,24],[0,5,6]]#1,4,7,25 rows+ 1,6,7 columns

   first_name        county    postal
0     Aleshia          Kent   CT2 7PP
3     Ulysses  Lincolnshire  DN36 5RP
6        Marg   Southampton  SO14 3TY
24       Tess   West Sussex  PO19 1RH

In [ ]:
df23.iloc[0:5,5:8]#first 5 rows and 5,6,7,columns

            county    postal        phone1
0             Kent   CT2 7PP  01835-703597
1  Buckinghamshire  HP11 2AX  01937-864715
2      Bournemouth   BH6 3BE  01347-368222
3     Lincolnshire  DN36 5RP  01912-771311
4    West Midlands   B70 9DT  01547-429341

##Fetching using loc

In [ ]:
df23.set_index("last_name",inplace=True)
df23.head()

KeyError: ignored

In [ ]:
df23.head()

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
Zigomalas        Evan  ...     http://www.capgeminiamerica.co.uk
Andrade        France  ...      http://www.elliottjohnwesq.co.uk
Mcwalters     Ulysses  ...          http://www.mcmahanbenl.co.uk
Veness         Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 10 columns]

In [ ]:
df23.loc[["Andrade","Veness"],"city":"email"]

                                     city  ...                       email
last_name                                  ...
Andrade    East Southbourne and Tuckton W  ...  france.andrade@hotmail.com
Veness         Greets Green and Lyng Ward  ...   tyisha.veness@hotmail.com

[2 rows x 6 columns]

In [ ]:
df23.loc["Andrade":"Veness",["first_name","address","city"]]

          first_name            address                            city
last_name
Andrade       France       8 Moor Place  East Southbourne and Tuckton W
Mcwalters    Ulysses      505 Exeter Rd              Hawerby cum Beesby
Veness        Tyisha  5396 Forth Street      Greets Green and Lyng Ward

##Boolean and logical indexing using loc

In [ ]:
df23.loc[df23["first_name"]=="Antonio","city":"email"]

                                      city  ...                            email
last_name                                   ...
Villamarin  Little Parndon and Hare Street  ...     antonio.villamarin@gmail.com
Glasford                    Gaer Community  ...  antonio_glasford@glasford.co.uk
Heilig                            Ipplepen  ...         antonio.heilig@gmail.com

[3 rows x 6 columns]

In [ ]:
df23.loc[((df23["county"]=="Kent")&(df23["first_name"]=="Aleshia")),"city":"email"]

                         city county  ...        phone2                    email
last_name                             ...
Tomkiewicz  St. Stephens Ward   Kent  ...  01944-369967  atomkiewicz@hotmail.com

[1 rows x 6 columns]

In [ ]:
#select rows where the email column ends with "hotmail.com",include all columns
df23.loc[df23["email"].str.endswith("hotmail.com")]

           first_name  ...                                          web
last_name              ...
Tomkiewicz    Aleshia  ...         http://www.alandrosenburgcpapc.co.uk
Andrade        France  ...             http://www.elliottjohnwesq.co.uk
Mcwalters     Ulysses  ...                 http://www.mcmahanbenl.co.uk
Veness         Tyisha  ...               http://www.champagneroom.co.uk
Grasmick         Marg  ...     http://www.wranglehillautoauctslvg.co.uk
...               ...  ...                                          ...
Gaucher        Sophia  ...               http://www.tcesystemsinc.co.uk
Ausdemore      Rosita  ...              http://www.jurdemscottesq.co.uk
Stancil          Huey  ...                http://www.lindnerfunds.co.uk
Fiorino        Elbert  ...            http://www.donaldgnelsonesq.co.uk
Richan             Mi  ...  http://www.nelsonwrighthaworthgolfcrs.co.uk

[114 rows x 10 columns]

In [ ]:

print(len(df23.loc[df23["email"].str.endswith("gmail.com")]))

130

In [ ]:
#other functions are startswith(),contains,find

In [ ]:
df23.loc[df23["first_name"].isin (["France","Tyisha","Eric"])]

          first_name  ...                                   web
last_name             ...
Andrade       France  ...      http://www.elliottjohnwesq.co.uk
Veness        Tyisha  ...        http://www.champagneroom.co.uk
Rampy           Eric  ...  http://www.thompsonmichaelcesq.co.uk

[3 rows x 10 columns]

In [ ]:
df23.loc[df23["email"].str.endswith("gmail.com")& (df23["first_name"]=="Antonio")]

           first_name  ...                                  web
last_name              ...
Villamarin    Antonio  ...     http://www.combssheetmetal.co.uk
Heilig        Antonio  ...  http://www.radissonsuitehotel.co.uk

[2 rows x 10 columns]

In [ ]:
#A lambda function thAT YIELDS T/F VALUES CAN ALSO BE READ
df23.loc[df23["company_name"].apply(lambda x: len(x.split(" "))==4)]

            first_name  ...                                         web
last_name               ...
Andrade         France  ...            http://www.elliottjohnwesq.co.uk
Rampy             Eric  ...        http://www.thompsonmichaelcesq.co.uk
Erm        Charlesetta  ...               http://www.cainjohnmesq.co.uk
Throssell      Michell  ...            http://www.weissspirtguyer.co.uk
Kanne            Edgar  ...          http://www.crowankennethwesq.co.uk
...                ...  ...                                         ...
Alsaqri          Ahmad  ...  http://www.allianceconstructioncoinc.co.uk
Reibman     Jacquelyne  ...          http://www.greatclipsforhair.co.uk
Kono          Isabelle  ...  http://www.rockspringspetroleumequip.co.uk
Fiorino         Elbert  ...           http://www.donaldgnelsonesq.co.uk
Keeny        Celestina  ...      http://www.bfgfederalcreditunion.co.uk

[192 rows x 10 columns]

In [ ]:
#without iloc
df23[(df23["county"]=="Kent")&(df23["first_name"]=="Aleshia")]

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk

[1 rows x 10 columns]

In [ ]:
df23.loc[(df23["county"]=="Kent")&(df23["first_name"]=="Aleshia")]

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk

[1 rows x 10 columns]

## Change data using iloc and loc

In [ ]:
df23.loc[(df23["county"]=="Kent"),["first_name"]]="Shakthi"

In [ ]:
df23.loc[(df23["county"]=="Kent")&(df23["first_name"]=="Shakthi")]

           first_name  ...                                          web
last_name              ...
Tomkiewicz    Shakthi  ...         http://www.alandrosenburgcpapc.co.uk
Writer        Shakthi  ...             http://www.krassociatesinc.co.uk
Thurm         Shakthi  ...    http://www.burgesssteelproductscorp.co.uk
Dease         Shakthi  ...      http://www.sunderlandpublishingco.co.uk
Crete         Shakthi  ...                  http://www.mdwrailway.co.uk
Yurich        Shakthi  ...    http://www.blainecostructuralmovers.co.uk
Wendorf       Shakthi  ...      http://www.russellameliamosleyesq.co.uk
Puskarich     Shakthi  ...           http://www.drubnernormansesq.co.uk
Geschke       Shakthi  ...  http://www.levysecurityconsultantsltd.co.uk
Handsaker     Shakthi  ...         http://www.shirleysprintshoppe.co.uk
Dubberly      Shakthi  ...    http://www.lmindustrialchemicalsinc.co.uk
Shadd         Shakthi  ...        http://www.pigeonfallsstatebank.co.uk
Sheneman      Shakthi  ...            http://www.jonesbrighampesq.co.uk
Colamarino    Shakthi  ...         http://www.proctorassociatesco.co.uk
Mercik        Shakthi  ...                  http://www.leestandvm.co.uk
Flori         Shakthi  ...   http://www.marinesafetyinternational.co.uk
Maricle       Shakthi  ...           http://www.gartonjeffreypesq.co.uk
Kernagis      Shakthi  ...         http://www.digitalsolutionsinc.co.uk
Leadbeater    Shakthi  ...    http://www.murraywhisnantarchitects.co.uk
Farrin        Shakthi  ...             http://www.deringjameseesq.co.uk
Humeniuk      Shakthi  ...    http://www.guldstrandengineeringinc.co.uk
Tischner      Shakthi  ...                http://www.malepowerltd.co.uk

[22 rows x 10 columns]

In [ ]:
df23.loc[(df23["first_name"]=="Shakthi"),["company_name","city"]]=["Amrita Vishwa Vidhyapeetham","Coimbatore"]

In [ ]:
df23.loc[df23.first_name=="Shakthi"]

           first_name  ...                                          web
last_name              ...
Tomkiewicz    Shakthi  ...         http://www.alandrosenburgcpapc.co.uk
Writer        Shakthi  ...             http://www.krassociatesinc.co.uk
Thurm         Shakthi  ...    http://www.burgesssteelproductscorp.co.uk
Dease         Shakthi  ...      http://www.sunderlandpublishingco.co.uk
Crete         Shakthi  ...                  http://www.mdwrailway.co.uk
Yurich        Shakthi  ...    http://www.blainecostructuralmovers.co.uk
Wendorf       Shakthi  ...      http://www.russellameliamosleyesq.co.uk
Puskarich     Shakthi  ...           http://www.drubnernormansesq.co.uk
Geschke       Shakthi  ...  http://www.levysecurityconsultantsltd.co.uk
Handsaker     Shakthi  ...         http://www.shirleysprintshoppe.co.uk
Dubberly      Shakthi  ...    http://www.lmindustrialchemicalsinc.co.uk
Shadd         Shakthi  ...        http://www.pigeonfallsstatebank.co.uk
Sheneman      Shakthi  ...            http://www.jonesbrighampesq.co.uk
Colamarino    Shakthi  ...         http://www.proctorassociatesco.co.uk
Mercik        Shakthi  ...                  http://www.leestandvm.co.uk
Flori         Shakthi  ...   http://www.marinesafetyinternational.co.uk
Maricle       Shakthi  ...           http://www.gartonjeffreypesq.co.uk
Kernagis      Shakthi  ...         http://www.digitalsolutionsinc.co.uk
Leadbeater    Shakthi  ...    http://www.murraywhisnantarchitects.co.uk
Farrin        Shakthi  ...             http://www.deringjameseesq.co.uk
Humeniuk      Shakthi  ...    http://www.guldstrandengineeringinc.co.uk
Tischner      Shakthi  ...                http://www.malepowerltd.co.uk

[22 rows x 10 columns]

In [ ]:
import pandas as pd
data=pd.read_csv("https://raw.githubusercontent.com/fivethirtyeight/data/master/cabinet-turnover/cabinet-turnover.csv")
data.head()

  president                                  position  ... length   days
0    Carter                              OMB Director  ...    245  247.0
1    Carter               Secretary of Transportation  ...    908  912.0
2    Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3    Carter  Secretary of Housing & Urban Development  ...    922  926.0
4    Carter                 Secretary of the Treasury  ...    923  927.0

[5 rows x 7 columns]

In [ ]:
data.shape

(312, 7)

In [ ]:
data.dtypes

president     object
position      object
appointee     object
start         object
end           object
length        object
days         float64
dtype: object

    president                                  position  ... length   days
0      Carter                              OMB Director  ...    245  247.0
1      Carter               Secretary of Transportation  ...    908  912.0
2      Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3      Carter  Secretary of Housing & Urban Development  ...    922  926.0
4      Carter                 Secretary of the Treasury  ...    923  927.0
..        ...                                       ...  ...    ...    ...
307     Trump            Secretary of Homeland Security  ...    NaN    NaN
308     Trump      Secretary of Health & Human Services  ...    NaN    NaN
309     Trump                        Secretary of State  ...    NaN    NaN
310     Trump                              CIA Director  ...    NaN    NaN
311     Trump             Secretary of Veterans Affairs  ...    NaN    NaN

[312 rows x 7 columns]

In [ ]:
data.loc[data["position"].str.startswith("Secretary")]

    president                                  position  ... length   days
1      Carter               Secretary of Transportation  ...    908  912.0
2      Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3      Carter  Secretary of Housing & Urban Development  ...    922  926.0
4      Carter                 Secretary of the Treasury  ...    923  927.0
7      Carter                       Secretary of Energy  ...    747  946.0
..        ...                                       ...  ...    ...    ...
305     Trump                        Secretary of Labor  ...    NaN    NaN
307     Trump            Secretary of Homeland Security  ...    NaN    NaN
308     Trump      Secretary of Health & Human Services  ...    NaN    NaN
309     Trump                        Secretary of State  ...    NaN    NaN
311     Trump             Secretary of Veterans Affairs  ...    NaN    NaN

[175 rows x 7 columns]

In [ ]:
data.loc[(data['position']=='OMB Director')& (data['president']=='Clinton')]['appointee']

122    Leon Panetta
129    Alice Rivlin
142    Frank Raines
151        Jack Lew
Name: appointee, dtype: object

In [ ]:
import pandas as pd
data1=pd.read_csv("https://raw.githubusercontent.com/akki8087/Big-Mart-Sales/master/Train.csv")
data1.head()

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15         9.30  ...  Supermarket Type1          3735.1380
1           DRC01         5.92  ...  Supermarket Type2           443.4228
2           FDN15        17.50  ...  Supermarket Type1          2097.2700
3           FDX07        19.20  ...      Grocery Store           732.3800
4           NCD19         8.93  ...  Supermarket Type1           994.7052

[5 rows x 12 columns]

##Apply function

In [ ]:
data.apply(lambda x:x)

    president                                  position  ... length   days
0      Carter                              OMB Director  ...    245  247.0
1      Carter               Secretary of Transportation  ...    908  912.0
2      Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3      Carter  Secretary of Housing & Urban Development  ...    922  926.0
4      Carter                 Secretary of the Treasury  ...    923  927.0
..        ...                                       ...  ...    ...    ...
307     Trump            Secretary of Homeland Security  ...    NaN    NaN
308     Trump      Secretary of Health & Human Services  ...    NaN    NaN
309     Trump                        Secretary of State  ...    NaN    NaN
310     Trump                              CIA Director  ...    NaN    NaN
311     Trump             Secretary of Veterans Affairs  ...    NaN    NaN

[312 rows x 7 columns]

In [ ]:
data.apply(lambda x:x[0])

president          Carter
position     OMB Director
appointee      Bert Lance
start             1/21/77
end               9/23/77
length                245
days                  247
dtype: object

In [ ]:
data.apply(lambda x:x[0],axis=1)
#axis=1 means column
#axis=0 means row(default)

0      Carter
1      Carter
2      Carter
3      Carter
4      Carter
        ...
307     Trump
308     Trump
309     Trump
310     Trump
311     Trump
Length: 312, dtype: object

In [ ]:
def clip_price(price):
  if price>200:
    price=200
  return price

In [ ]:
def clip_price1(price):
  if price>150:
    price=150
  return price

In [ ]:
data1["Item_MRP"][:5]

0    249.8092
1     48.2692
2    141.6180
3    182.0950
4     53.8614
Name: Item_MRP, dtype: float64

In [ ]:
data1["Item_MRP"]=data1["Item_MRP"].apply(lambda x:clip_price(x))[:5]

In [ ]:
#this has the Same functionality as the above stmt
data1["Item_MRP"]=data1["Item_MRP"].apply(clip_price1)

In [ ]:
data1

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0              FDA15        9.300  ...  Supermarket Type1          3735.1380
1              DRC01        5.920  ...  Supermarket Type2           443.4228
2              FDN15       17.500  ...  Supermarket Type1          2097.2700
3              FDX07       19.200  ...      Grocery Store           732.3800
4              NCD19        8.930  ...  Supermarket Type1           994.7052
...              ...          ...  ...                ...                ...
8518           FDF22        6.865  ...  Supermarket Type1          2778.3834
8519           FDS36        8.380  ...  Supermarket Type1           549.2850
8520           NCJ29       10.600  ...  Supermarket Type1          1193.1136
8521           FDN46        7.210  ...  Supermarket Type2          1845.5976
8522           DRG01       14.800  ...  Supermarket Type1           765.6700

[8523 rows x 12 columns]

In [ ]:
def label_encode(city):
  if city=="Tier 1":
    label=0
  elif city=="Tier 2":
    label=1
  else:
    label=2
  return label

In [ ]:
data1["Outlet_Location_Type"][:5]

0    Tier 1
1    Tier 3
2    Tier 1
3    Tier 3
4    Tier 3
Name: Outlet_Location_Type, dtype: object

In [ ]:
data1.dtypes

Item_Identifier               object
Item_Weight                  float64
Item_Fat_Content              object
Item_Visibility              float64
Item_Type                     object
Item_MRP                     float64
Outlet_Identifier             object
Outlet_Establishment_Year      int64
Outlet_Size                   object
Outlet_Location_Type          object
Outlet_Type                   object
Item_Outlet_Sales            float64
dtype: object

In [ ]:
data1["Outlet_Location_Type"]=data1["Outlet_Location_Type"].apply(label_encode)

In [ ]:
data1.dtypes

Item_Identifier               object
Item_Weight                  float64
Item_Fat_Content              object
Item_Visibility              float64
Item_Type                     object
Item_MRP                     float64
Outlet_Identifier             object
Outlet_Establishment_Year      int64
Outlet_Size                   object
Outlet_Location_Type           int64
Outlet_Type                   object
Item_Outlet_Sales            float64
dtype: object

In [ ]:
data1["Outlet_Location_Type"][:5]

0    0
1    2
2    0
3    2
4    2
Name: Outlet_Location_Type, dtype: int64

In [ ]:
df=pd.read_html("https://www.contextures.com/xlSampleData01.html")

In [ ]:
df[0].describe()

                0        1      2       3   4     5       6
count          44       44     44      44  44    44      44
unique         44        4     12       6  38    13      42
top     OrderDate  Central  Jones  Binder   7  4.99  449.10
freq            1       24      8      15   2    12       2

##Missing data

In [ ]:
df=pd.read_csv("https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv")
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

In [ ]:
df["ST_NUM"].isnull()
#detects NaN

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [ ]:
df["SQ_FT"].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

In [ ]:
df["NUM_BEDROOMS"].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [ ]:
missing_values=["n/a","na","--"]
df=pd.read_csv("https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv",na_values=missing_values)
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df["NUM_BEDROOMS"].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

In [ ]:
df["SQ_FT"].isnull()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

In [ ]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH         object
SQ_FT           float64
dtype: object

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
import pandas as pd
import numpy as np
df=pd.read_csv("https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv")
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

##Using regex

In [ ]:
missing_values=["n/a","na","--"]
df=pd.read_csv("https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv",na_values=missing_values)
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df["OWN_OCCUPIED"]=df["OWN_OCCUPIED"].replace(r'[0-9]+',np.nan,regex=True)

In [ ]:
df["NUM_BATH"]=df["NUM_BATH"].replace(r'[A-Z]',np.nan,regex=True)

In [ ]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH         object
SQ_FT           float64
dtype: object

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

##Filling missing values

In [ ]:
df.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        2
SQ_FT           2
dtype: int64

In [ ]:
#Any missing values?
df.isnull().any()

PID              True
ST_NUM           True
ST_NAME         False
OWN_OCCUPIED     True
NUM_BEDROOMS     True
NUM_BATH         True
SQ_FT            True
dtype: bool

In [ ]:
#total missing values
df.isnull().sum().sum()

12

In [ ]:
#Filling missing values 
df.fillna(0)#NaN-->0

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     0.0
2  100003000.0     0.0   LEXINGTON            N           0.0        1   850.0
3  100004000.0   201.0    BERKELEY            0           1.0        0   700.0
4          0.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           0.0        1   800.0
6  100007000.0     0.0  WASHINGTON            0           2.0        0   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     0.0
8  100009000.0   215.0     TREMONT            Y           0.0        2  1800.0

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.fillna(method="bfill")
#we can fill bfill or ffill as method
#backwardfill or forwardfill

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5   850.0
2  100003000.0   201.0   LEXINGTON            N           1.0        1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0        2   700.0
4  100006000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.0        1   800.0
6  100007000.0   213.0  WASHINGTON            Y           2.0        1   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1  1800.0
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.fillna(method="ffill")

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5  1000.0
2  100003000.0   197.0   LEXINGTON            N           3.0        1   850.0
3  100004000.0   201.0    BERKELEY            N           1.0        1   700.0
4  100004000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           3.0        1   800.0
6  100007000.0   207.0  WASHINGTON            Y           2.0        1   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1   950.0
8  100009000.0   215.0     TREMONT            Y           1.0        2  1800.0

In [ ]:
#will replace Nan value in df with value=-99
df.fillna(-99)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5   -99.0
2  100003000.0   -99.0   LEXINGTON            N         -99.0        1   850.0
3  100004000.0   201.0    BERKELEY          -99           1.0      -99   700.0
4        -99.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y         -99.0        1   800.0
6  100007000.0   -99.0  WASHINGTON          -99           2.0      -99   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1   -99.0
8  100009000.0   215.0     TREMONT            Y         -99.0        2  1800.0

In [ ]:
#using dropna()
df.dropna()

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0        1  1000.0

In [ ]:
df.dropna(how="all")

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.dropna(axis=1)

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [ ]:
#making new df with dropped NAn values
new_data=df.dropna(axis=0,how="any")
new_data

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0        1  1000.0

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
new_data2=df.dropna(axis=1,how="any")
new_data2

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
import pandas as pd
dataset=pd.read_csv("https://gist.githubusercontent.com/ktisha/c21e73a1bd1700294ef790c56c8aec1f/raw/819b69b5736821ccee93d05b51de0510bea00294/pima-indians-diabetes.csv",skiprows=9,header=None)
dataset.head(20)

     0    1   2   3    4     5      6   7  8
0    6  148  72  35    0  33.6  0.627  50  1
1    1   85  66  29    0  26.6  0.351  31  0
2    8  183  64   0    0  23.3  0.672  32  1
3    1   89  66  23   94  28.1  0.167  21  0
4    0  137  40  35  168  43.1  2.288  33  1
5    5  116  74   0    0  25.6  0.201  30  0
6    3   78  50  32   88  31.0  0.248  26  1
7   10  115   0   0    0  35.3  0.134  29  0
8    2  197  70  45  543  30.5  0.158  53  1
9    8  125  96   0    0   0.0  0.232  54  1
10   4  110  92   0    0  37.6  0.191  30  0
11  10  168  74   0    0  38.0  0.537  34  1
12  10  139  80   0    0  27.1  1.441  57  0
13   1  189  60  23  846  30.1  0.398  59  1
14   5  166  72  19  175  25.8  0.587  51  1
15   7  100   0   0    0  30.0  0.484  32  1
16   0  118  84  47  230  45.8  0.551  31  1
17   7  107  74   0    0  29.6  0.254  31  1
18   1  103  30  38   83  43.3  0.183  33  0
19   1  115  70  30   96  34.6  0.529  32  1

In [ ]:
dataset[[1,2,3,4,5]]=dataset[[1,2,3,4,5]].replace(0,np.nan)
print(dataset.isnull().sum())

0      0
1      5
2     35
3    227
4    374
5     11
6      0
7      0
8      0
dtype: int64

In [ ]:
dataset.head()

   0      1     2     3      4     5      6   7  8
0  6  148.0  72.0  35.0    NaN  33.6  0.627  50  1
1  1   85.0  66.0  29.0    NaN  26.6  0.351  31  0
2  8  183.0  64.0   NaN    NaN  23.3  0.672  32  1
3  1   89.0  66.0  23.0   94.0  28.1  0.167  21  0
4  0  137.0  40.0  35.0  168.0  43.1  2.288  33  1

In [ ]:
dataset.dropna(inplace=True)

In [ ]:
dataset.fillna(dataset.mean(),inplace=True)
#replace with column wise mean

In [ ]:
dataset.head(10)

    0      1          2         3           4          5      6   7  8
0   6  148.0  72.000000  35.00000  155.548223  33.600000  0.627  50  1
1   1   85.0  66.000000  29.00000  155.548223  26.600000  0.351  31  0
2   8  183.0  64.000000  29.15342  155.548223  23.300000  0.672  32  1
3   1   89.0  66.000000  23.00000   94.000000  28.100000  0.167  21  0
4   0  137.0  40.000000  35.00000  168.000000  43.100000  2.288  33  1
5   5  116.0  74.000000  29.15342  155.548223  25.600000  0.201  30  0
6   3   78.0  50.000000  32.00000   88.000000  31.000000  0.248  26  1
7  10  115.0  72.405184  29.15342  155.548223  35.300000  0.134  29  0
8   2  197.0  70.000000  45.00000  543.000000  30.500000  0.158  53  1
9   8  125.0  96.000000  29.15342  155.548223  32.457464  0.232  54  1